In [90]:
import pandas as pd
import numpy as np

In [91]:
# 1. Write a Python program to create and display a one-dimensional array-like object containing 
# an array of data using Pandas module.
data = pd.Series([10, 20, 30, 40, 50])
print(data)

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [92]:
# 2. Write a Python program to convert a Panda module Series to Python list and it's type.
data_list = data.tolist()
print(data_list)

[10, 20, 30, 40, 50]

In [93]:
#3. Write a Python program to add, subtract, multiple and divide two Pandas Series.
data1 = pd.Series([2, 4, 6, 8, 10]) 
data2 = pd.Series([1, 3, 5, 7, 9])
print(f"Addition:\n {data1 + data2}")
print(f"Subtraction:\n {data1 - data2}")
print(f"Multiplication:\n {data1 * data2}")
print(f"Division:\n {data1 / data2}")

Addition:
 0     3
1     7
2    11
3    15
4    19
dtype: int64
Subtraction:
 0    1
1    1
2    1
3    1
4    1
dtype: int64
Multiplication:
 0     2
1    12
2    30
3    56
4    90
dtype: int64
Division:
 0    2.000000
1    1.333333
2    1.200000
3    1.142857
4    1.111111
dtype: float64

In [94]:
#  4. Write a Python program to get the powers of an array values element-wise.
# Note: First array elements raised to powers from second array
data1 = pd.Series([0, 1, 2, 3, 4, 5, 6])
data2 = pd.Series([0, 1, 2, 3, 4, 5, 6])
print(data1 ** data2)

0        1
1        1
2        4
3       27
4      256
5     3125
6    46656
dtype: int64

In [95]:
# 5. Write a Python program to create and display a DataFrame from a specified dictionary
# data which has the index labels.

exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael',
                      'Matthew', 'Laura', 'Kevin', 'Jonas'],
            'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
            'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
            'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']
}
data = pd.DataFrame(exam_data, index=['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j'])
print(data)

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

In [96]:
# 6. Write a Python program to display a summary of the basic information about a
# specified Data Frame and its data.
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael',
                      'Matthew', 'Laura', 'Kevin', 'Jonas'],
            'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
            'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
            'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']
}
labels=['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
data = pd.DataFrame(exam_data, index=labels)
print(data.info())

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, a to j
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   name      10 non-null     object
 1   score     8 non-null      float64
 2   attempts  10 non-null     int64
 3   qualify   10 non-null     object
dtypes: float64(1), int64(1), object(2)
memory usage: 400.0+ bytes
None

In [97]:
# 7. Write a Python program to get the first 3 rows of a given DataFrame.
print(data.head(3))

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes

In [98]:
# 8. Write a Python program to select the 'name' and 'score' columns from the following
# DataFrame.

print(data[['name', 'score']])

        name  score
a  Anastasia   12.5
b       Dima    9.0
c  Katherine   16.5
d      James    NaN
e      Emily    9.0
f    Michael   20.0
g    Matthew   14.5
h      Laura    NaN
i      Kevin    8.0
j      Jonas   19.0

In [99]:
# 9. Write a Python program to select the specified columns and rows from a given dataframe.

data.loc[['a', 'c', 'e', 'f'], ['name', 'score']]

        name  score
a  Anastasia   12.5
c  Katherine   16.5
e      Emily    9.0
f    Michael   20.0

In [100]:
# 10. Write a Python program to select the rows where the number of attempts in the examination is greater than 2.

data[data['attempts'] > 2]

      name  score  attempts qualify
b     Dima    9.0         3      no
d    James    NaN         3      no
f  Michael   20.0         3     yes

In [101]:
# 11. Write a Python program to count the number of rows and columns of a DataFrame.

rows, cols = data.shape
print(f"Number of rows: {rows}\nNumber of columns: {cols}")

Number of rows: 10
Number of columns: 4

In [102]:
# 12. Write a Python program to select the rows where the score is missing, i.e. is NaN.

data[data['score'].isna()]

    name  score  attempts qualify
d  James    NaN         3      no
h  Laura    NaN         1      no

In [103]:
# 13. Write a Python program to select the rows where number of attempts in the 
# examination is less than 2 and score greater than 15.

data[(data['attempts'] < 2) & (data['score'] > 15)]

    name  score  attempts qualify
j  Jonas   19.0         1     yes

In [104]:
# 14. Write a Python program to change the score in row 'd' to 11.5.

data.loc['d', 'score'] = 11.5
data

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James   11.5         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

In [105]:
# 15. Write a Python program to calculate the sum of the examination attempts by the students.
data["attempts"].sum()

np.int64(19)

In [106]:
# 16. Write a Python program to calculate the mean score for each different student in DataFrame.
data['score'].mean()

np.float64(13.333333333333334)

In [107]:
# 17. Write a Python program to append a new row 'k' to data frame with given values for each column. Now delete the new row and return the original DataFrame.
data.loc['k'] = {'name':'Suresh', 'score':15.5, 'attempts': 1, 'qualify': 'yes'}
data = data.drop('k')
data

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James   11.5         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

In [108]:
# 18. Write a Python program to sort the DataFrame first by 'name' in descending order, then by 'score' in ascending order.
data.sort_values(by=['name'], ascending = False)
data.sort_values(by=['score'], ascending=True)

        name  score  attempts qualify
i      Kevin    8.0         2      no
b       Dima    9.0         3      no
e      Emily    9.0         2      no
d      James   11.5         3      no
a  Anastasia   12.5         1     yes
g    Matthew   14.5         1     yes
c  Katherine   16.5         2     yes
j      Jonas   19.0         1     yes
f    Michael   20.0         3     yes
h      Laura    NaN         1      no

In [109]:
# 19. Write a Python program to replace the 'qualify' column contains the values 'yes' and 'no' with True and False.
data["qualify"] = data["qualify"].map({"yes" : True, "no" : False }) 
data

        name  score  attempts  qualify
a  Anastasia   12.5         1     True
b       Dima    9.0         3    False
c  Katherine   16.5         2     True
d      James   11.5         3    False
e      Emily    9.0         2    False
f    Michael   20.0         3     True
g    Matthew   14.5         1     True
h      Laura    NaN         1    False
i      Kevin    8.0         2    False
j      Jonas   19.0         1     True

In [110]:
# 20. Write a Python program to delete the 'attempts' column from the DataFrame.
data = data.drop("attempts", axis=1)
data

        name  score  qualify
a  Anastasia   12.5     True
b       Dima    9.0    False
c  Katherine   16.5     True
d      James   11.5    False
e      Emily    9.0    False
f    Michael   20.0     True
g    Matthew   14.5     True
h      Laura    NaN    False
i      Kevin    8.0    False
j      Jonas   19.0     True

In [111]:
# 21. Write a Python program to insert a new column in existing DataFrame.
data["attempts"] = [1,3,4,5,4,2,1,2,1,3]
data

        name  score  qualify  attempts
a  Anastasia   12.5     True         1
b       Dima    9.0    False         3
c  Katherine   16.5     True         4
d      James   11.5    False         5
e      Emily    9.0    False         4
f    Michael   20.0     True         2
g    Matthew   14.5     True         1
h      Laura    NaN    False         2
i      Kevin    8.0    False         1
j      Jonas   19.0     True         3

In [112]:
# 22. Write a Python program to iterate over rows in a DataFrame.
for index, row in data.iterrows():
    row_list = list(row)
    print(f"Index: {index}\nRow data: {row_list}\n")

Index: a
Row data: ['Anastasia', 12.5, True, 1]

Index: b
Row data: ['Dima', 9.0, False, 3]

Index: c
Row data: ['Katherine', 16.5, True, 4]

Index: d
Row data: ['James', 11.5, False, 5]

Index: e
Row data: ['Emily', 9.0, False, 4]

Index: f
Row data: ['Michael', 20.0, True, 2]

Index: g
Row data: ['Matthew', 14.5, True, 1]

Index: h
Row data: ['Laura', nan, False, 2]

Index: i
Row data: ['Kevin', 8.0, False, 1]

Index: j
Row data: ['Jonas', 19.0, True, 3]

In [113]:
# 23. Write a Python program to get list from DataFrame column headers.
column_head = data.columns.to_list()
column_head

['name', 'score', 'qualify', 'attempts']